In [1]:
import pandas as pd

In [2]:
dict = {
    'name': ['Zh3', 'Li4', 'Wang5', 'Zhao6'],
    'sex' : ['Male','Female', 'Male', 'Female'],
    'age' : [18, 19, 20, 21]
}

In [3]:
dict

{'name': ['Zh3', 'Li4', 'Wang5', 'Zhao6'],
 'sex': ['Male', 'Female', 'Male', 'Female'],
 'age': [18, 19, 20, 21]}

In [4]:
df = pd.DataFrame(dict)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   sex     4 non-null      object
 2   age     4 non-null      int64
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [8]:
df.age.astype('str')

0    18
1    19
2    20
3    21
Name: age, dtype: object

In [14]:
df[['name','sex']]

    name     sex
0    Zh3    Male
1    Li4  Female
2  Wang5    Male
3  Zhao6  Female

In [17]:
df.name

0      Zh3
1      Li4
2    Wang5
3    Zhao6
Name: name, dtype: object

In [20]:
df.iloc[0]

name     Zh3
sex     Male
age       18
Name: 0, dtype: object

In [21]:
df

    name     sex  age
0    Zh3    Male   18
1    Li4  Female   19
2  Wang5    Male   20
3  Zhao6  Female   21

In [25]:
df[0:2]

  name     sex  age
0  Zh3    Male   18
1  Li4  Female   19

In [30]:
df[1:]

    name     sex  age
1    Li4  Female   19
2  Wang5    Male   20
3  Zhao6  Female   21

In [ ]:
# Assignment

In [32]:
df.age = 22

In [34]:
df['age'] = [18,19,20,33]

In [35]:
df

    name     sex  age
0    Zh3    Male   18
1    Li4  Female   19
2  Wang5    Male   20
3  Zhao6  Female   33

In [37]:
#adding a new column

In [46]:
df['Country'] = ['China', 'SG', 'MY','ID']

In [47]:
df

    name     sex  age Country
0    Zh3    Male   18   China
1    Li4  Female   19      SG
2  Wang5    Male   20      MY
3  Zhao6  Female   33      ID

In [48]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [50]:
df[ df.age > 18]

    name     sex  age Country
1    Li4  Female   19      SG
2  Wang5    Male   20      MY
3  Zhao6  Female   33      ID

In [51]:
df.age > 18

0    False
1     True
2     True
3     True
Name: age, dtype: bool

In [54]:
df[ df.sex == 'Male']

    name   sex  age Country
0    Zh3  Male   18   China
2  Wang5  Male   20      MY

In [56]:
(df.sex == 'Male') & (df.age > 19)

0    False
1    False
2     True
3    False
dtype: bool

In [57]:
df[ (df.sex == 'Male') & (df.age > 19) ]

    name   sex  age Country
2  Wang5  Male   20      MY

In [58]:
df

    name     sex  age Country
0    Zh3    Male   18   China
1    Li4  Female   19      SG
2  Wang5    Male   20      MY
3  Zhao6  Female   33      ID

In [61]:
df.query(  '(sex == "Male") and (age>10)  ')

    name   sex  age Country
0    Zh3  Male   18   China
2  Wang5  Male   20      MY